#  Вывод года по китайскому календарю

a = int(input("Введите год: "))

if a % 12 == 0:
    print(f"{a} год - Год Обезьяны")
if a % 12 == 1:
    print(f"{a} год - Год Петуха")
if a % 12 == 2:
    print(f"{a} год - Год Собаки")
if a % 12 == 3:
    print(f"{a} год - Год Свиньи")
if a % 12 == 4:
    print(f"{a} год - Год Крысы")
if a % 12 == 5:
    print(f"{a} год - Год Быка")
if a % 12 == 6:
    print(f"{a} год - Год Тигра")
if a % 12 == 7:
    print(f"{a} год - Год Кролика")
if a % 12 == 8:
    print(f"{a} год - Год Дракона")
if a % 12 == 9:
    print(f"{a} год - Год Змеи")
if a % 12 == 10:
    print(f"{a} год - Год Лошади")
if a % 12 == 11:
    print(f"{a} год - Год Козы")